mbarbeau0545/Stm32PrjTpl/src/1_FMK/FMK_HAL/FMK_CDA/Src/FMK_CDA.c
/*********************************************************************
 * @file        FMK_IO.c
 * @brief       Template_BriefDescription.
 * @note        TemplateDetailsDescription.\n
 *
 * @author      xxxxxx
 * @date        jj/mm/yyyy
 * @version     1.0
 */

// ********************************************************************
// *                      Includes
// ********************************************************************
#include "./FMK_CDA.h"
#include "FMK_HAL/FMK_MAC/Src/FMK_MAC.h"
#include "FMK_HAL/FMK_CPU/Src/FMK_CPU.h"
#include "FMK_CFG/FMKCFG_ConfigFiles/FMKCDA_ConfigPrivate.h"
#include "stm32f0xx_hal.h"

// ********************************************************************
// *                      Defines
// ********************************************************************
#define FMKCDA_CHNLCFG_PER_CYCLE ((t_uint8)5) /* Number of channel configuration per Cycle*/
// ********************************************************************
// *                      Types
// ********************************************************************
//-----------------------------ENUM TYPES-----------------------------//
/* CAUTION : Automatic generated code section for Enum: Start */

/* CAUTION : Automatic generated code section for Enum: End */
/**< enum for Channel error status*/
typedef enum
{
    FMKCDA_CHANNEL_STATE_OK = 0,            /**< No error detected on channel */
    FMKCDA_CHANNEL_STATE_ERR_INTERNAL,      /**< Internal/ bsp error detected on channel */
    FMKCDA_CHANNEL_STATE_ERR_OVR,           /**< overrun error detetcted on channel */
    FMKCDA_CHANNEL_STATE_ERR_DMA,           /**< Dma error detetected on channel */
    FMKCDA_CHANNEL_STATE_CB,                /**< callback error detetected on channel */
    FMKCDA_CHANNEL_STATE_JQOVF,             /**< to do */

    FMKCDA_CHANNEL_STATE_NB                 /**< Number of channel state error */
} t_eFMKCDA_ChnlErrState;

//-----------------------------TYPEDEF TYPES---------------------------//
//-----------------------------STRUCT TYPES---------------------------//
/* CAUTION : Automatic generated code section for Structure: Start */

/* CAUTION : Automatic generated code section for Structure: End */
/**< Structure for store and manage analog value in Scan_Dma mode */
typedef struct
{
    t_uint16 rawValue_au16[FMKCDA_ADC_CHANNEL_NB];                  /**< Array for analog value for all channel */
    t_eFMKCPU_InterruptChnl BspChnlmapp[FMKCDA_ADC_CHANNEL_NB];     /**< Mapping with raywvalue array and channelINfo structure abalog value */    
    t_bool FlagValueUpdated_b;                                      /**< Flag to know whenever the adc ennding a conversion */
} t_sFMKCDA_AdcBuffer;

/**< Structure for adc channel information*/
typedef struct
{
    t_uint16 rawValue_u16;              /**< the analog value for this channel */
    t_bool FlagValueUpdated_b;          /**< Flag to know when the rawvalue is available */
    t_bool IsChnlUsed_b;                /**< Flag to know if the channel is currently used */
    t_bool IsChnlConfigured_b;          /**< Flag to know if the channel if configured well */
    t_eFMKCDA_ChnlErrState Error_e;     /**< Store the channel error status */
} t_sFMKCDA_ChnlInfo;

/**< Structure for adc information*/
typedef struct
{
    ADC_HandleTypeDef BspInit_s;                            /**< Store the bsp information needed */
    t_eFMKCDA_HwAdcCfg HwCfg_e;                             /**< Store in which mode the ADC is currently set */
    t_sFMKCDA_ChnlInfo Channel_as[FMKCDA_ADC_CHANNEL_NB];   /**< Structure channel information for each channel */
    const t_eFMKCPU_ClockPort clock_e;                      /**< constant to store the clock for each ADC */
    const t_eFMKCPU_IRQNType IRQNType_e;                    /**< constant to store the IRQN for each ADC */
    t_bool IsAdcConfigured_b;                               /**< Flag to know if the ADC is configured */
    t_bool IsAdcRunning_b;                                  /**< Flag to know if the Adc is running a conversion */
} t_sFMKCDA_AdcInfo;
// ********************************************************************
// *                      Prototypes
// ********************************************************************

// ********************************************************************
// *                      Variables
// ********************************************************************
/**< store the raw value for each channel of each adc converter*/
t_sFMKCDA_AdcBuffer g_AdcBuffer_as[FMKCDA_ADC_NB];
// Flag automatic generate code
/**< Store the Adc Info variable*/
t_sFMKCDA_AdcInfo g_AdcInfo_as[FMKCDA_ADC_NB] = {
    {
        // ADC_1
        .BspInit_s.Instance = ADC1,
        .clock_e = FMKCPU_RCC_CLK_ADC1,
        .IRQNType_e = ADC1_IRQn,
    }
};

static t_eCyclicFuncState g_state_e = STATE_CYCLIC_WAITING;

// Flag automatic generate code
/**< Rank for each channel add for ADC */
t_uint8 g_counterRank_au8[FMKCDA_ADC_NB] = { 
    (t_uint8)1
}; 

//********************************************************************************
//                      Local functions - Prototypes
//********************************************************************************
/**
 *
 *	@brief      Function to get the bsp channel based on the value of f_channel_e.\n
 *
 *	@param[in]  f_channel_e           : enum adc channel, value from @ref t_eFMKCDA_AdcChannel
 *	@param[in]  f_bspChannel_32       : bsp adc channel uint32
 *
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_PARAM_NOT_SUPPORTED      @ref RC_ERROR_PARAM_NOT_SUPPORTED
 *
 */
static t_eReturnState s_FMKCDA_Get_BspChannel(t_eFMKCDA_AdcChannel f_channel_e, t_uint32 *f_bspChannel_32);
/**
 *
 *	@brief      Function to set the bsp adc Init.\n
 *  @note       Depending on f_HwAdcCfg_e this function set the bsp Init with the right 
 *              element and call hal_adc_init and set the rcc clock enable.\n 
 *              
 *
 *	@param[in]  f_Adc_e               : enum adc, value from @ref t_eFMKCDA_Adc
 *	@param[in]  f_HwAdcCfg_e          : enum for adc configuration, value from @ref t_eFMKCDA_HwAdcCfg
 *
 * @retval RC_OK                             @ref RC_OK
 * @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 * @retval RC_ERROR_WRONG_STATE              @ref RC_ERROR_WRONG_STATE
 *
 */
static t_eReturnState s_FMKCDA_Set_BspAdcCfg(t_eFMKCDA_Adc f_Adc_e,
                                             t_eFMKCDA_HwAdcCfg f_HwAdcCfg_e);
/**
 *
 *	@brief      Function to set the bsp channel Init.\n
 *  @note       The ADC config must be set before calling this function.n
 *              This function allow user to configure a adc_channel -> f_channel_e from 
 *              an ADC -> f_Adc_e.\n This function call hal_set_adc_channel.\n
 *              If hardware failed, this function return retcode Wrong_State
 *              
 *
 *	@param[in]  f_Adc_e               : enum adc, value from @ref t_eFMKCDA_Adc
 *	@param[in]  f_channel_e           : enum adc channel, value from @ref t_eFMKCDA_AdcChannel
 *
 * @retval RC_OK                             @ref RC_OK
 * @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 * @retval RC_ERROR_ALREADY_CONFIGURED           @ref RC_ERROR_ALREADY_CONFIGURED
 * @retval RC_ERROR_WRONG_STATE              @ref RC_ERROR_WRONG_STATE
 *
 */
static t_eReturnState s_FMKCDA_Set_BspChannelCfg(t_eFMKCDA_Adc f_Adc_e, t_eFMKCDA_AdcChannel f_channel_e);
/**
 *
 *	@brief      Perform cyclic operation for this module.\n
 *  @note       Every Cycle in OPE_MODE, this function start Adc conversion 
 *              if the adc is config as so (Interruption or Dma). If a previous conversion 
 *              is finished, this function store the value in the right channel and update 
 *              flag in consequence.\n This function also perform cyclic diagnostic on channel
 *              every x seconds, parameter reference in configPrivate.\n
 *              
 * @retval RC_OK                               @ref RC_OK
 * @retval RC_WARNING_WRONG_STATE              @ref RC_ERROR_WARNING_STATE
 * @retval RC_WARNING_BUSY                     @ref RC_WARNING_BUSY
 *
 */
static t_eReturnState s_FMKCDA_Operational(void);
//****************************************************************************
//                      Public functions - Implementation
//********************************************************************************
/*********************************
 * FMKCDA_Init
 *********************************/
t_eReturnState FMKCDA_Init(void)
{
    t_uint8 LLI1_u8 = 0;
    t_uint8 LLI2_u8 = 0;
    // initiate to default value variable structure
    for (LLI1_u8 = (t_uint8)0; LLI1_u8 < (t_uint8)FMKCDA_ADC_NB; LLI1_u8++)
    { // all timer
        g_AdcInfo_as[LLI1_u8].IsAdcConfigured_b = (t_bool)False;
        g_AdcInfo_as[LLI1_u8].IsAdcRunning_b = (t_bool)False;

