mbarbeau0545/Stm32PrjTpl/src/1_FMK/FMK_HAL/FMK_CDA/Src/FMK_CDA.c
        for (LLI2_u8 = (t_uint8)0; LLI2_u8 < (t_uint8)FMKCDA_ADC_CHANNEL_NB; LLI2_u8++)
        { // all channel for a timer
            g_AdcInfo_as[LLI1_u8].Channel_as[LLI2_u8].IsChnlConfigured_b = (t_bool)False;
            g_AdcInfo_as[LLI1_u8].Channel_as[LLI2_u8].Error_e = FMKCDA_CHANNEL_STATE_OK;
            g_AdcInfo_as[LLI1_u8].Channel_as[LLI2_u8].IsChnlUsed_b = (t_bool)False;
            g_AdcInfo_as[LLI1_u8].Channel_as[LLI2_u8].rawValue_u16 = (t_uint16)0;
        }
    }
    return RC_OK;
}

/*********************************
 * FMKCDA_Init
 *********************************/
t_eReturnState FMKCDA_Cyclic(void)
{
    t_eReturnState Ret_e = RC_OK;

    switch (g_state_e)
    {
        case STATE_CYCLIC_WAITING:
        {
            // nothing to do just wait AppSys Signal
            break;
        }
        case STATE_CYCLIC_OPE:
        {
            Ret_e = s_FMKCDA_Operational();
            break;
        }
        case STATE_CYCLIC_ERROR:
        {
            break;
        }
        case STATE_CYCLIC_PREOPE:
        case STATE_CYCLIC_BUSY:
        default:
            Ret_e = RC_OK;
            break;
    }
    return Ret_e;
}

/*********************************
 * FMKCDA_GetState
 *********************************/
t_eReturnState FMKCDA_GetState(t_eCyclicFuncState *f_State_pe)
{
    t_eReturnState Ret_e = RC_OK;
    
    if(f_State_pe == (t_eCyclicFuncState *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        *f_State_pe = g_state_e;
    }

    return Ret_e;
}

/*********************************
 * FMKCDA_SetState
 *********************************/
t_eReturnState FMKCDA_SetState(t_eCyclicFuncState f_State_e)
{

    g_state_e = f_State_e;
    return RC_OK;
}

/*********************************
 * FMKCDA_Set_AdcChannelCfg
 *********************************/
t_eReturnState FMKCDA_Set_AdcChannelCfg(t_eFMKCDA_Adc f_Adc_e,
                                        t_eFMKCDA_AdcChannel f_channel_e,
                                        t_eFMKCDA_HwAdcCfg f_hwAdcCfg_e)
{
    t_eReturnState Ret_e = RC_OK;

    if (f_Adc_e > FMKCDA_ADC_NB || f_channel_e > FMKCDA_ADC_CHANNEL_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if (Ret_e == RC_OK)
    {
        if (g_AdcInfo_as[f_Adc_e].IsAdcConfigured_b == (t_bool)False)
        { // configure adc timer
            Ret_e = s_FMKCDA_Set_BspAdcCfg((t_eFMKCDA_Adc)f_Adc_e,
                                           f_hwAdcCfg_e);
            if (Ret_e == RC_OK)
            {
            #warning "Only Scan/DMA mode is trreated for AdcChannel Configuration"
                Ret_e = FMKMAC_RqstDmaInit(FMKMAC_DMA_RQSTYPE_ADC1, (void *)&g_AdcInfo_as[f_Adc_e].BspInit_s);
                if (Ret_e == RC_OK)
                {
                    g_AdcInfo_as[f_Adc_e].IsAdcConfigured_b = True;
                    g_AdcInfo_as[f_Adc_e].HwCfg_e = f_hwAdcCfg_e;
                }
            }
        }
        if (Ret_e == RC_OK)
        { // Configure Channel
            Ret_e = s_FMKCDA_Set_BspChannelCfg(f_Adc_e, f_channel_e);
        }
    }
    return Ret_e;
}

/*********************************
 * FMKCDA_Get_AnaChannelMeasure
 *********************************/
t_eReturnState FMKCDA_Get_AnaChannelMeasure(t_eFMKCDA_Adc f_Adc_e, t_eFMKCDA_AdcChannel f_channel_e, t_uint16 *f_AnaMeasure_u16)
{
    t_eReturnState Ret_e = RC_OK;

    if (f_Adc_e > FMKCDA_ADC_NB || f_channel_e > FMKCDA_ADC_CHANNEL_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if (f_AnaMeasure_u16 == (t_uint16 *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(g_state_e != STATE_CYCLIC_OPE)
    {
        Ret_e = RC_ERROR_MODULE_NOT_INITIALIZED;
    }
    if(g_AdcInfo_as[f_Adc_e].IsAdcConfigured_b == (t_bool)False
    || g_AdcInfo_as[f_Adc_e].Channel_as[f_channel_e].IsChnlConfigured_b == (t_bool)False)
    {
        Ret_e = RC_ERROR_ALREADY_CONFIGURED;
    }
    if (Ret_e == RC_OK)
    {
        // give the last raw analog value if value is updated
        if (g_AdcInfo_as[f_Adc_e].Channel_as[f_channel_e].FlagValueUpdated_b == (t_bool)True)
        {
            *f_AnaMeasure_u16 = g_AdcInfo_as[f_Adc_e].Channel_as[f_channel_e].rawValue_u16;
            g_AdcInfo_as[f_Adc_e].Channel_as[f_channel_e].FlagValueUpdated_b = (t_bool)False;
        }
        else
        {
            *f_AnaMeasure_u16 = (t_uint16)0;
            Ret_e = RC_WARNING_NO_OPERATION;
        }
    }
    return Ret_e;
}
//********************************************************************************
//                      Local functions - Implementation
//********************************************************************************
/*********************************
 * s_FMKCDA_Operational
 *********************************/
static t_eReturnState s_FMKCDA_Operational(void)
{
    t_eReturnState Ret_e = RC_OK;
    HAL_StatusTypeDef bspRet_e = HAL_OK;
    t_uint8 LLI_u8;
    t_uint8 LLI2_u8;
    t_eFMKCPU_InterruptChnl channel_e;

    for(LLI_u8 = (t_uint8)0 ; LLI_u8 < (t_uint8)FMKCDA_ADC_NB ; LLI_u8++)
    {
        // if ADc buffer for this ADC has been filled 
        if(g_AdcBuffer_as[LLI_u8].FlagValueUpdated_b == (t_bool)True)
        {// 
            g_AdcBuffer_as[LLI_u8].FlagValueUpdated_b = (t_bool)False;
            for(LLI2_u8 = (t_uint8)0 ; LLI2_u8 < g_counterRank_au8[LLI_u8] ; LLI2_u8++)
            {
                channel_e = g_AdcBuffer_as[LLI_u8].BspChnlmapp[LLI2_u8];
                g_AdcInfo_as[LLI_u8].Channel_as[channel_e].rawValue_u16 = 
                    g_AdcBuffer_as[LLI_u8].rawValue_au16[LLI2_u8];

                g_AdcInfo_as[LLI_u8].Channel_as[channel_e].FlagValueUpdated_b = (t_bool)True;
            }
        }
        else
        {
            bspRet_e = HAL_ADC_Start_DMA(&g_AdcInfo_as[LLI_u8].BspInit_s,
                                         (t_uint32 *)g_AdcBuffer_as[LLI_u8].rawValue_au16,
                                         g_counterRank_au8[LLI_u8]);
            
            if(bspRet_e != HAL_OK)
            {
                Ret_e = RC_ERROR_WRONG_STATE;
            }
            else
            {
                g_AdcInfo_as[LLI_u8].IsAdcRunning_b = True;
            }
        }
    }

    return Ret_e;
}

